---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.GetFamilyInstanceId
source: html/b219f66a-497c-b7ca-a1fa-6cf36287b7a4.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.GetFamilyInstanceId Method

Gets the Id of the fiting or accessory instance

## Syntax (C#)
```csharp
public ElementId GetFamilyInstanceId()
```

## Returns
The element Id of the fiting or accessory instance.